import type { 
  TFooterPlaces, 
  TDISH,
} from "../types/types"


export const VICTOR_MENU: TDISH[] = [
  {
    id: 1,
    dish: "Карпаччо «Цезарь на отдыхе»",
    description: "Тончайшая говядина с трюфельным маслом. Настолько изысканно, что ваша диета сама подпишет акт о капитуляции.",
    price: 730,
    image: "../src/assets/images.jpg" 
  },
  {
    id: 2,
    dish: "Салат «Veni, Vidi, Vici»",
    description: "Наше прочтение Цезаря с креветками-гигантами. Пришел, увидел, заказал добавку.",
    price: 480,
    image: "../src/assets/images.jpg"
  },
  {
    id: 3,
    dish: "Тартар «Абсолютный триумф»",
    description: "Лосось с авокадо и секретным соусом. Блюдо для тех, кто не боится сырых решений и ярких побед.",
    price: 999,
    image: "../src/assets/images.jpg"
  },
  {
    id: 4,
    dish: "Суп «Золото Империи»",
    description: "Пряный тыквенный крем-суп с имбирем. Согревает душу и эго быстрее, чем любые комплименты.",
    price: 850,
    image: "../src/assets/images.jpg"
  },
  {
    id: 5,
    dish: "Стейк «Рибай Victor»",
    description: "Главный калибр нашего меню. Премиальная говядина для тех, кто привык забирать лучший кусок в любой ситуации.",
    price: 1200,
    image: "../src/assets/images.jpg"
  },
  {
    id: 6,
    dish: "Утиная грудка «Крылья успеха»",
    description: "С ягодным конфитюром и пюре из сельдерея. Птица высокого полета для вашего гастрономического взлета.",
    price: 500,
    image: "../src/assets/images.jpg"
  },
  {
    id: 7,
    dish: "Лингуине «Римские каникулы»",
    description: "Паста с морепродуктами в соусе из белого вина. Вкус, который заставляет забыть о рабочих чатах и дедлайнах.",
    price: 560,
    image: "../src/assets/images.jpg"
  },
  {
    id: 8,
    dish: "Дорадо «Честный трофей»",
    description: "Цельная рыба на гриле с травами. Ничего лишнего — только чистый вкус честно заработанного ужина.",
    price: 900,
    image: "../src/assets/images.jpg"
  },
  {
    id: 9,
    dish: "Каре ягненка «Право сильного»",
    description: "Нежные ребра с соусом демиглас. Блюдо, которое не требует переговоров — только наслаждения.",
    price: 750,
    image: "../src/assets/images.jpg"
  },
  {
    id: 10,
    dish: "Ризотто «Белые воротнички»",
    description: "Сливочное ризотто с белыми грибами. Выбор тех, кто знает толк в серьезных сделках и правильных обедах.",
    price: 570,
    image: "../src/assets/images.jpg"
  },
  {
    id: 11,
    dish: "Фондан «Черный пояс по сладостям»",
    description: "Горячий шоколадный десерт. Единственная битва, в которой вы с удовольствием сдадитесь на милость сахара.",
    price: 330,
    image: "../src/assets/images.jpg"
  },
  {
    id: 12,
    dish: "Чизкейк «Виктория»",
    description: "Классический нью-йорк с малиновым соусом. Финальный аккорд, после которого хочется аплодировать шефу стоя.",
    price: 420,
    image: "../src/assets/images.jpg"
  }
];


export const FOOTER_PLACES: TFooterPlaces[] = [
  {
    name: "Victor Grand",
    addres: "Манежная 34", 
  },
  {
    name: "Victor Social",
    addres: "ул. Большая Садовая, 12", 
  },
  {
    name: "Victor Terrace",
    addres: "Набережная, 5", 
  }
];